projects/openfoam/rarefied-flows/impingment/sims/templates/compressible/rhoCentralFoam/wedge15Ma5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       19000;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       19080;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          40;
        startFace       19160;
    }
    top
    {
        type            patch;
        nFaces          120;
        startFace       19200;
    }
    obstacle
    {
        type            patch;
        nFaces          80;
        startFace       19320;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19200;
        startFace       19400;
    }
)

// ************************************************************************* //
